driver-tests/filebc/JavaEE_vs_BC/FileOneWayOut_JBI/src/jbiasa/SoapTrigger4FileOneWayOut.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/SoapTrigger4FileOneWayOut"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/SoapTrigger4FileOneWayOut" name="SoapTrigger4FileOneWayOut" xmlns:ns="http://xml.netbeans.org/schema/SimpleSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/SoapTrigger4FileOneWayOut">
            <xsd:import namespace="http://xml.netbeans.org/schema/SimpleSchema" schemaLocation="SimpleSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="SoapTrigger4FileOneWayOutOperationRequest">
        <part name="part1" type="ns:requestType"/>
    </message>
    <message name="SoapTrigger4FileOneWayOutOperationReply">
        <part name="part1" type="ns:responseType"/>
    </message>
    <portType name="SoapTrigger4FileOneWayOutPortType">
        <wsdl:operation name="SoapTrigger4FileOneWayOutOperation">
            <wsdl:input name="input1" message="tns:SoapTrigger4FileOneWayOutOperationRequest"/>
            <wsdl:output name="output1" message="tns:SoapTrigger4FileOneWayOutOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="SoapTrigger4FileOneWayOutBinding" type="tns:SoapTrigger4FileOneWayOutPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="SoapTrigger4FileOneWayOutOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SoapTrigger4FileOneWayOut"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SoapTrigger4FileOneWayOut"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="SoapTrigger4FileOneWayOutService">
        <wsdl:port name="SoapTrigger4FileOneWayOutPort" binding="tns:SoapTrigger4FileOneWayOutBinding">
            <soap:address location="http://localhost:18181/SoapTrigger4FileOneWayOutService/SoapTrigger4FileOneWayOutPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="SoapTrigger4FileOneWayOutPartner">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="SoapTrigger4FileOneWayOutPortTypeRole" portType="tns:SoapTrigger4FileOneWayOutPortType"/>
    </plnk:partnerLinkType>
</definitions>
