driver-tests/filebc/JavaEE_vs_BC/FileOneWayOut_JBI/test/2ejb2file/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://j2ee.netbeans.org/wsdl/SoapTrigger4FileOneWayOut" xmlns:sim="http://xml.netbeans.org/schema/SimpleSchema">
  <soapenv:Body>
    <soap:SoapTrigger4FileOneWayOutOperation>
      <part1>
        <sim:requestElement>test data for testcase "2ejb2file"</sim:requestElement>
      </part1>
    </soap:SoapTrigger4FileOneWayOutOperation>
  </soapenv:Body>
</soapenv:Envelope>